---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairstypeWinderStepFrontMeasurement
source: html/a7c4d29b-c2d7-42d6-6145-10727c7e3356.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairstypeWinderStepFrontMeasurement Property

"Winder Algorithm": Winder Algorithm

## Syntax (C#)
```csharp
public static ForgeTypeId StairstypeWinderStepFrontMeasurement { get; }
```